; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-5-6-4)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-1 - location
	p1-2 - location
	p1-3 - location
	p1-4 - location
	p2-0 - location
	p4-3 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s3)
	(at driver3 s3)
	(at driver4 s0)
	(at driver5 s1)
	(at truck1 s0)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at truck4 s1)
	(empty truck4)
	(at truck5 s3)
	(empty truck5)
	(at truck6 s0)
	(empty truck6)
	(at package1 s3)
	(at package2 s2)
	(at package3 s2)
	(at package4 s3)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 83)
	(= (time-to-walk p0-1 s0) 83)
	(= (time-to-walk s1 p0-1) 16)
	(= (time-to-walk p0-1 s1) 16)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 65)
	(= (time-to-walk p1-2 s1) 65)
	(= (time-to-walk s2 p1-2) 68)
	(= (time-to-walk p1-2 s2) 68)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(= (time-to-walk s1 p1-3) 3)
	(= (time-to-walk p1-3 s1) 3)
	(= (time-to-walk s3 p1-3) 68)
	(= (time-to-walk p1-3 s3) 68)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 59)
	(= (time-to-walk p1-4 s1) 59)
	(= (time-to-walk s4 p1-4) 48)
	(= (time-to-walk p1-4 s4) 48)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 62)
	(= (time-to-walk p2-0 s2) 62)
	(= (time-to-walk s0 p2-0) 49)
	(= (time-to-walk p2-0 s0) 49)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(= (time-to-walk s4 p4-3) 82)
	(= (time-to-walk p4-3 s4) 82)
	(= (time-to-walk s3 p4-3) 28)
	(= (time-to-walk p4-3 s3) 28)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 63)
	(= (time-to-drive s1 s0) 63)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 51)
	(= (time-to-drive s4 s0) 51)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 54)
	(= (time-to-drive s4 s1) 54)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 32)
	(= (time-to-drive s1 s2) 32)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 70)
	(= (time-to-drive s0 s3) 70)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 60)
	(= (time-to-drive s1 s3) 60)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 67)
	(= (time-to-drive s2 s4) 67)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 34)
	(= (time-to-drive s3 s4) 34)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s3)
	(at driver2 s0)
	(at truck1 s4)
	(at truck2 s0)
	(at truck3 s4)
	(at truck5 s1)
	(at truck6 s0)
	(at package1 s4)
	(at package2 s2)
	(at package3 s3)
	(at package4 s0)
	))

(:metric minimize (+ (+ (* 2  (total-time)) (* 1  (driven))) (* 4  (walked))))

)

; plan
1. (board-truck driver1 truck2 s4)
   deleted: (at driver1 s4) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 2 of 11
2. (board-truck driver2 truck5 s3)
   deleted: (at driver2 s3) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 2 of 11
3. (drive-truck truck5 s3 s1 driver2)
   deleted: (at truck5 s3)
   added: (at truck5 s1)
   changed: (driven) from 0 to 60
   goals met: 3 of 11
4. (board-truck driver4 truck1 s0)
   deleted: (at driver4 s0) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 3 of 11
5. (drive-truck truck1 s0 s4 driver4)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   changed: (driven) from 60 to 111
   goals met: 4 of 11
6. (drive-truck truck5 s1 s0 driver2)
   deleted: (at truck5 s1)
   added: (at truck5 s0)
   changed: (driven) from 111 to 174
   goals met: 3 of 11
7. (drive-truck truck2 s4 s3 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   changed: (driven) from 174 to 208
   goals met: 3 of 11
8. (load-truck package1 truck2 s3)
   deleted: (at package1 s3)
   added: (in package1 truck2)
   goals met: 3 of 11
9. (load-truck package4 truck2 s3)
   deleted: (at package4 s3)
   added: (in package4 truck2)
   goals met: 3 of 11
10. (drive-truck truck2 s3 s4 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   changed: (driven) from 208 to 242
   goals met: 3 of 11
11. (unload-truck package1 truck2 s4)
   deleted: (in package1 truck2)
   added: (at package1 s4)
   goals met: 4 of 11
12. (drive-truck truck2 s4 s0 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   changed: (driven) from 242 to 293
   goals met: 5 of 11
13. (unload-truck package4 truck2 s0)
   deleted: (in package4 truck2)
   added: (at package4 s0)
   goals met: 6 of 11
14. (drive-truck truck1 s4 s2 driver4)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   changed: (driven) from 293 to 360
   goals met: 5 of 11
15. (load-truck package3 truck1 s2)
   deleted: (at package3 s2)
   added: (in package3 truck1)
   goals met: 5 of 11
16. (drive-truck truck1 s2 s4 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   changed: (driven) from 360 to 427
   goals met: 6 of 11
17. (drive-truck truck1 s4 s3 driver4)
   deleted: (at truck1 s4)
   added: (at truck1 s3)
   changed: (driven) from 427 to 461
   goals met: 5 of 11
18. (unload-truck package3 truck1 s3)
   deleted: (in package3 truck1)
   added: (at package3 s3)
   goals met: 6 of 11
19. (drive-truck truck1 s3 s4 driver4)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   changed: (driven) from 461 to 495
   goals met: 7 of 11
20. (drive-truck truck1 s4 s2 driver4)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   changed: (driven) from 495 to 562
   goals met: 6 of 11
21. (drive-truck truck2 s0 s3 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   changed: (driven) from 562 to 632
   goals met: 5 of 11
22. (disembark-truck driver4 truck1 s2)
   deleted: (driving driver4 truck1)
   added: (at driver4 s2) (empty truck1)
   goals met: 5 of 11
23. (board-truck driver4 truck3 s2)
   deleted: (at driver4 s2) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 5 of 11
24. (drive-truck truck3 s2 s4 driver4)
   deleted: (at truck3 s2)
   added: (at truck3 s4)
   changed: (driven) from 632 to 699
   goals met: 6 of 11
25. (disembark-truck driver2 truck5 s0)
   deleted: (driving driver2 truck5)
   added: (at driver2 s0) (empty truck5)
   goals met: 7 of 11
26. (walk driver2 s0 p2-0)
   deleted: (at driver2 s0)
   added: (at driver2 p2-0)
   changed: (walked) from 0 to 49
   goals met: 6 of 11
27. (disembark-truck driver1 truck2 s3)
   deleted: (driving driver1 truck2)
   added: (at driver1 s3) (empty truck2)
   goals met: 7 of 11
28. (walk driver2 p2-0 s2)
   deleted: (at driver2 p2-0)
   added: (at driver2 s2)
   changed: (walked) from 49 to 111
   goals met: 7 of 11
29. (board-truck driver2 truck1 s2)
   deleted: (at driver2 s2) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 7 of 11
30. (drive-truck truck1 s2 s4 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   changed: (driven) from 699 to 766
   goals met: 8 of 11
31. (drive-truck truck1 s4 s0 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   changed: (driven) from 766 to 817
   goals met: 7 of 11
32. (disembark-truck driver2 truck1 s0)
   deleted: (driving driver2 truck1)
   added: (at driver2 s0) (empty truck1)
   goals met: 8 of 11
33. (board-truck driver1 truck2 s3)
   deleted: (at driver1 s3) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 7 of 11
34. (drive-truck truck2 s3 s0 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   changed: (driven) from 817 to 887
   goals met: 8 of 11
35. (board-truck driver2 truck5 s0)
   deleted: (at driver2 s0) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 7 of 11
36. (drive-truck truck5 s0 s1 driver2)
   deleted: (at truck5 s0)
   added: (at truck5 s1)
   changed: (driven) from 887 to 950
   goals met: 8 of 11
37. (disembark-truck driver1 truck2 s0)
   deleted: (driving driver1 truck2)
   added: (at driver1 s0) (empty truck2)
   goals met: 8 of 11
38. (disembark-truck driver2 truck5 s1)
   deleted: (driving driver2 truck5)
   added: (at driver2 s1) (empty truck5)
   goals met: 8 of 11
39. (walk driver2 s1 p0-1)
   deleted: (at driver2 s1)
   added: (at driver2 p0-1)
   changed: (walked) from 111 to 127
   goals met: 8 of 11
40. (walk driver2 p0-1 s0)
   deleted: (at driver2 p0-1)
   added: (at driver2 s0)
   changed: (walked) from 127 to 210
   goals met: 9 of 11
41. (board-truck driver2 truck1 s0)
   deleted: (at driver2 s0) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 8 of 11
42. (drive-truck truck1 s0 s4 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   changed: (driven) from 950 to 1001
   goals met: 9 of 11
43. (disembark-truck driver2 truck1 s4)
   deleted: (driving driver2 truck1)
   added: (at driver2 s4) (empty truck1)
   goals met: 9 of 11
44. (board-truck driver1 truck2 s0)
   deleted: (at driver1 s0) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 9 of 11
45. (drive-truck truck2 s0 s4 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   changed: (driven) from 1001 to 1052
   goals met: 8 of 11
46. (disembark-truck driver1 truck2 s4)
   deleted: (driving driver1 truck2)
   added: (at driver1 s4) (empty truck2)
   goals met: 8 of 11
47. (walk driver1 s4 p4-3)
   deleted: (at driver1 s4)
   added: (at driver1 p4-3)
   changed: (walked) from 210 to 292
   goals met: 8 of 11
48. (board-truck driver2 truck2 s4)
   deleted: (at driver2 s4) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 8 of 11
49. (walk driver1 p4-3 s3)
   deleted: (at driver1 p4-3)
   added: (at driver1 s3)
   changed: (walked) from 292 to 320
   goals met: 9 of 11
50. (drive-truck truck2 s4 s0 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   changed: (driven) from 1052 to 1103
   goals met: 10 of 11
51. (disembark-truck driver2 truck2 s0)
   deleted: (driving driver2 truck2)
   added: (at driver2 s0) (empty truck2)
   goals met: 11 of 11
